app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."sch" DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]
---
  def top_of_products
    @products = Product.search(params[:search]).order(:sch).reverse_order.page(params[:page])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def get_cart_winner
    @products = []
    @products << Product.find(session[:cart].first)
    @products << Product.find(session[:cart].last)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "products" SET "updated_at" = ?, "sch" = ? WHERE "products"."id" = ?  [["updated_at", "2021-05-31 10:31:44.010014"], ["sch", 3], ["id", 3]]
---
  def get_cart_winner_product
    id = params[:format]
    session[:cart] = []
    session[:cart] << id unless session[:cart].include?(id)
    p=Product.find(id)
    p.sch+=1
    p.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def load_cart
    if user_signed_in?
      @cart=Product.find(session[:cart])

SELECT "products".* FROM "products" ORDER BY "products"."title" DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]
---
  def index
    @products = Product.search(params[:search]).order(:title).reverse_order.page(params[:page])

INSERT INTO "products" ("title", "body", "created_at", "updated_at", "mark", "color", "engine", "sch") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "body" = ?, "updated_at" = ?, "mark" = ?, "color" = ?, "engine" = ? WHERE "products"."id" = ?  [["title", "Dildo"], ["body", "Bzzzzzzz"], ["updated_at", "2021-05-31 09:23:59.269718"], ["mark", "Другое"], ["color", "другое"], ["engine", "электро"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    authorize @product
    @product.destroy