app/views/products/_edit_form.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <p>Марка:
  <%= form.select :mark, options_for_select(["Škoda", "BMW", "Audi", "Mercedes", "Ford", "Honda", "Другое"], Product.find(params[:id]).mark) %></p>
  <p>Цвет:
  <%= form.select :color, options_for_select(["чёрный", "серый", "белый", "красный", "зелёный", "синий", "другое"], Product.find(params[:id]).color) %></p>
  <p>Двигатель:
  <%= form.select :engine, options_for_select(["бензиноый", "дизельный", "гибрид", "электро"], Product.find(params[:id]).engine) %></p>